posts/emacs-ispell-aspell.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs with aspell/ispell on Nix Darwin</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/stylesorg.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.6.0/css/all.min.css">
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Fira+Mono&display=swap">
<link rel="icon" type="image/x-icon" href="/favicon.ico">
</head>
<body>
<div id="preamble" class="status">
<hr style="border-top: 1px solid black;">
<div class='topnav' style='display: flex; justify-content: space-between; align-items: center;'>
  <a href="/index.html"><h2 style='margin-top: 0; margin-bottom: 0; margin-left:0px;'>mblognl</h2></a>
  <div>
    <a href='/about.html' style='font-weight:bold; font-style:italic;'>About Me</a> |
    <a href='/archive.html' style='font-weight:bold; font-style:italic;'>Blog</a> |
    <a href='/books.html' style='font-weight:bold; font-style:italic;'>Books</a> |
    <a href='/rss.xml' style='font-weight:bold; font-style:italic;'>RSS</a>
  </div>
</div>
<hr style="border-top: 1px solid black;">
</div>
<div id="content" class="content">
<header>
<h1 class="title">Emacs with aspell/ispell on Nix Darwin</h1>
</header>
<div id="outline-container-orga0861c2" class="outline-2">
<h2 id="orga0861c2">British English and Emacs</h2>
<div class="outline-text-2" id="text-orga0861c2">
<div class="PREVIEW" id="orgdeafce6">
<p>
I like writing and was keen to introduce an on-the-fly spellchecker in Emacs. Ispell is built in to the current version I'm using (29.1). However it was locked to the default US dictionary. Easy fix right?
</p>

</div>
</div>

<div id="outline-container-orgc31ea6f" class="outline-3">
<h3 id="orgc31ea6f">Discoveries</h3>
<div class="outline-text-3" id="text-orgc31ea6f">
<p>
Out the box the latest version of ispell on Nix Packages and built in Emacs does not have UK/British English default. So I started looking on Reddit and Googled ispell and Nix to see where I could go.
</p>
</div>
</div>

<div id="outline-container-orgda139ab" class="outline-3">
<h3 id="orgda139ab">Emacs philosophy and approach</h3>
<div class="outline-text-3" id="text-orgda139ab">
<p>
I am a strong believer in keeping things simple and with the introduction of 'use-package' and the extra features in 29.1 I was keen to rewrite my config and use as close to vanilla setup as possible. I took the very base of what was needed and started from scratch building outward and exploring built-in packages. My config file is available here: <a href="https://github.com/mbrignall/nix-darwin">nix-darwin repo</a>
</p>
</div>
</div>

<div id="outline-container-org4333460" class="outline-3">
<h3 id="org4333460">Emacs Aspell/Ispell config</h3>
<div class="outline-text-3" id="text-org4333460">
<p>
Add this to your <code>init.el</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Spellcheck
</span>(<span class="org-keyword">require</span> '<span class="org-constant">ispell</span>)
(<span class="org-keyword">setq</span> ispell-program-name <span class="org-string">"aspell"</span>)

(<span class="org-keyword">dolist</span> (hook '(text-mode-hook))
  (add-hook hook (<span class="org-keyword">lambda</span> () (flyspell-mode 1))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org291aec8" class="outline-3">
<h3 id="org291aec8">NixOS/ Nix Darwin</h3>
<div class="outline-text-3" id="text-org291aec8">
<p>
With the emphasis on declarative, reproducible systems, I've been using Nix for some time now. I have a config for Linux/NixOS outside of work, when at work I use a Macbook so have a Nix Darwin build for that. The addition of <code>aspell</code> with dictionaries was surprisingly simple once I'd worked out how to declare it in my configuration file:
</p>

<p>
<pre class="src src-nix">
<span class="org-comment-delimiter"># </span><span class="org-comment">System Packages</span>
<span class="org-keyword">environment.systemPackages</span> = with <span class="org-constant">pkgs</span>; [
<span class="org-comment-delimiter">  # </span><span class="org-comment">Applications</span>
  (<span class="org-keyword">aspellWithDicts</span> (<span class="org-constant">dicts:</span> with dicts; <span class="org-string">[ en en-computers en-science ]</span>))
<span class="org-constant">  ispell</span>
<span class="org-comment-delimiter">  # </span><span class="org-comment">Other Packages</span>
];</pre>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="postamble" style="text-align: center; margin-top: 20px; margin-bottom: 20px;"> 
               <p> Created by <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)  </p>
               </div>
</div>
</body>
</html>
